开多、开空、平多、平空流程整理：

在合约交易中，可以通过开多或开空某个合约，参与到市场价格波动中，并从中获利。
选择"开多"，意味着用户期望购买的合约价格会在未来上升。相反，如果选择"开空"，则代表着用户将合约卖出，并预测它的价值会在未来下跌。

1、开空指开仓做空。做空，又称空头、沽空（香港用语）、卖空（新加坡马来西亚用语）是一种股票、期货等的投资术语，是股票、期货等市场的一种操作模式。
2、开多指开仓做多。是一种金融市场如股票、外汇或期货等术语：就是看好股票、外汇或期货等未来的上涨前景而进行买入持有等待上涨获利。
做多就是做多头，多头对市场判断是上涨，就会立即进行股票买入，所以做多就是买入股票、外汇或期货等。
3、平仓是指期货交易者买入或者卖出与其所持期货合约的品种、数量及交割月份相同但交易方向相反的期货合约，了结期货交易的行为，简单的说就是“原先买入的就卖出，原先是卖出的就买入。”

举例一个交易对：ETH/USDT

========================================================================================================

1、开多流程: 预判价格会上涨。存入ETH, 借USDT实现开多

A. 先充值ETH;
B. 也可以用USDT在Uniswap兑换一部分ETH;
C. 回调uniswapV2Call函数，该函数会先拿到WETH;
D. 将WETH换成ETH，然后存款到Compound，提高抵押资产价值;
E. 从Compound借出USDT,并转回给到交易所uniswap;

========================================================================================================

2、开空流程: 预测它的价值会在未来下跌，将合约卖出。存入USDT,借ETH实现开空  
A. 先完成充值USDT;
B. 调用Uniswap进行Swap 操作，用WETH兑换出USDT;
C. 回调uniswapV2Call函数，该函数会先拿到USDT;
D. 将USDT存款到 Compound，提高抵押资产价值;
E. 从 Compound 借出 ETH，转成 WETH 后转回给到 Uniswap;
开空完成后,交易账户会在Compound存入了USDT,并借款ETH。

========================================================================================================

3、平多流程:
就是用户账户里的ETH兑换成USDT并还款

A. 根据要还款的USDT金额，计算出需要花费多少ETH;
B. 通过 Uniswap FlashSwap 功能先得到 USDT;
C. 将 USDT 还款给 Compound;
D. 从 Compound 中赎回部分 ETH;
E. 将 ETH 支付给到 Uniswap;
平多完成后,交易账户在Compound里的ETH存款会减少，USDT借款也会减少

========================================================================================================

4、平空流程:
就是用户账户里的USDT兑换成ETH并还款

A. 根据要还款的ETH金额，计算出需要花费多少USDT;
B. 通过Uniswap FlashSwap功能先得到ETH;
C. 将ETH还款给Compound;
D. 从Compound中赎回部分USDT;
E. 将USDT支付给到Uniswap.
平空完成后，交易账户在Compound里的USDT存款会减少，ETH借款也会减少

========================================================================================================
